SilenceLY05/STM32F103Standard/48-设置FLASH的读写保护与解除/User/protect/bsp_readWriteProtect.h
#ifndef __BSP_READWRITEPROTECT_H
#define __BSP_READWRITEPROTECT_H

#include "stm32f10x.h"

/* STM32大容量产品每页大小2KByte，中小产品每页1KByte */
#if defined (STM32F10X_HD) || defined (STM32F10X_HD_VL) || defined (STM32F10X_CL) || defined (STM32F10X_XL)
	#define FLASH_PAGE_SIZE      ((uint16_t)0x800)  // 2048
#else
	#define FLASH_PAGE_SIZE      ((uint16_t)0x400)  // 1024
#endif


//写入的起始地址和结束地址
#define WRITE_START_ADDR          ((uint32_t)0x08008000)
#define WRITE_END_ADDR            ((uint32_t)0x0800C000)

typedef enum{
	WRITE_PROTECTED = 0,
	NO_WRITE_PROTECT
}Protect_Status;



/****************** 信息输出 ******************/
#define FLASH_DEBUG_ON         1

#define FLASH_INFO(fmt,arg...)           printf("<<-FLASH-INFO->> "fmt"\n",##arg)
#define FLASH_ERROR(fmt,arg...)          printf("<<-FLASH-ERROR->> "fmt"\n",##arg)
#define FLASH_DEBUG(fmt,arg...)          do{\
                                          if(FLASH_DEBUG_ON)\
                                          printf("<<-FLASH-DEBUG->> [%d]"fmt"\n",__LINE__, ##arg);\
                                          }while(0)
Protect_Status WriteProtect_Status(void);
void WriteProtect_Toggle(void);
void ReadProtect_Toggle(void);

#endif  /* __BSP_READWRITEPROTECT_H */

